app/Http/Controllers/ResetPassword.php

    public function send(Request $request)
    {
        $email = $request->validate([
            'email' => ['required']
        ]);
        $user = User::where('email', $email)->first();
---
select * from `users` where `email` = 'letrunghieu2001@gmail.com' and `users`.`deleted_at` is null limit 1